load-test-200-users.yml
config:
  target: "https://api.collabkaroo.co.in"
  phases:
    # Directly ramp up to 200 concurrent users
    - duration: 30
      arrivalRate: 50
      name: "Quick ramp up"

    # Maintain 200 concurrent users for 5 minutes
    - duration: 300
      arrivalRate: 200
      name: "200 concurrent users - 5 minutes"

    # Cool down
    - duration: 30
      arrivalRate: 10
      name: "Cool down"

  http:
    timeout: 30

  ensure:
    maxErrorRate: 2        # Maximum 2% error rate acceptable
    p95: 2000              # 95% requests under 2 seconds
    p99: 5000              # 99% requests under 5 seconds

scenarios:
  - name: "Mixed Traffic Pattern"
    weight: 100
    flow:
      # 1. Health check
      - get:
          url: "/health"

      # 2. Browse campaigns (most common operation)
      - get:
          url: "/api/campaign"
      - think: 1

      # 3. View specific campaign details
      - get:
          url: "/api/campaign/{{ $randomNumber(1, 20) }}"
      - think: 2

      # 4. Get brand profile (public)
      - get:
          url: "/api/brand/profile/{{ $randomNumber(1, 10) }}"
      - think: 1

      # 5. Search cities
      - get:
          url: "/api/campaign/cities/search?query=Mumbai"
      - think: 1